In [1]:
import pandas as pd

In [20]:
df1=pd.read_csv("employees_basic.csv")
df2=pd.read_csv("employees_salary.csv")
df3=pd.read_csv("employees_dataset.csv")

In [5]:
df1.shape

(8, 3)

In [6]:
df1.head(8)

   Emp_ID   Name  Department
0     101  Aarav          IT
1     102   Diya          HR
2     103  Rohan     Finance
3     104  Sneha          IT
4     105  Rahul          HR
5     106  Meera   Marketing
6     107  Kavya     Finance
7     108   Amit  Operations

In [ ]:
df2.head(8)

   Emp_ID  Salary   Location
0     103   72000      Delhi
1     104   65000     Mumbai
2     105   56000    Chennai
3     106   90000  Bangalore
4     107   75000  Hyderabad
5     108   82000       Pune
6     109   68000    Kolkata
7     110   70000     Jaipur

Operations:

Inner=>Intersection=>Keeps only matching rows.

Outer Join=>Union=> Keeps all rows from both data frames, filling NAN for unmatched rows.

Left Join=>Keeps all rows from left data frame and matching rows from right.

Right Join=> Keeps all rows from right data frame and matching rows from left.

Common values + left data frame values

df1     df2

In [12]:
df1.columns

Index(['Emp_ID', 'Name', 'Department'], dtype='object')

In [11]:
df2.columns

Index(['Emp_ID', 'Salary', 'Location'], dtype='object')

In [13]:
inner_join=pd.merge(df1,df2, on="Emp_ID" , how="inner") # on=>based on common atrribute we are merging data frame
print("*****INNER JOIN*****")
print(inner_join)

*****INNER JOIN*****
   Emp_ID   Name  Department  Salary   Location
0     103  Rohan     Finance   72000      Delhi
1     104  Sneha          IT   65000     Mumbai
2     105  Rahul          HR   56000    Chennai
3     106  Meera   Marketing   90000  Bangalore
4     107  Kavya     Finance   75000  Hyderabad
5     108   Amit  Operations   82000       Pune

In [14]:
outer_join=pd.merge(df1,df2, on="Emp_ID" , how="outer")
print(outer_join)

   Emp_ID   Name  Department   Salary   Location
0     101  Aarav          IT      NaN        NaN
1     102   Diya          HR      NaN        NaN
2     103  Rohan     Finance  72000.0      Delhi
3     104  Sneha          IT  65000.0     Mumbai
4     105  Rahul          HR  56000.0    Chennai
5     106  Meera   Marketing  90000.0  Bangalore
6     107  Kavya     Finance  75000.0  Hyderabad
7     108   Amit  Operations  82000.0       Pune
8     109    NaN         NaN  68000.0    Kolkata
9     110    NaN         NaN  70000.0     Jaipur

In [18]:
left_join=pd.merge(df1,df2, on="Emp_ID" , how="left")
print(left_join)

   Emp_ID   Name  Department   Salary   Location
0     101  Aarav          IT      NaN        NaN
1     102   Diya          HR      NaN        NaN
2     103  Rohan     Finance  72000.0      Delhi
3     104  Sneha          IT  65000.0     Mumbai
4     105  Rahul          HR  56000.0    Chennai
5     106  Meera   Marketing  90000.0  Bangalore
6     107  Kavya     Finance  75000.0  Hyderabad
7     108   Amit  Operations  82000.0       Pune

In [19]:
right_join=pd.merge(df1,df2, on="Emp_ID" , how="right")
print(right_join)

   Emp_ID   Name  Department  Salary   Location
0     103  Rohan     Finance   72000      Delhi
1     104  Sneha          IT   65000     Mumbai
2     105  Rahul          HR   56000    Chennai
3     106  Meera   Marketing   90000  Bangalore
4     107  Kavya     Finance   75000  Hyderabad
5     108   Amit  Operations   82000       Pune
6     109    NaN         NaN   68000    Kolkata
7     110    NaN         NaN   70000     Jaipur

In [27]:
grouped=df3.groupby("Department")
grouped["Salary"].mean
# print(grouped)

In [24]:
grouped["Salary"].agg(["mean" , "min", "max"]).round(2)

                mean    min     max
Department
Finance     69503.67  50397   88074
HR          75932.12  59688  105811
IT          84138.00  69235   99134
Marketing   92313.50  73435  101648
Operations  82746.86  50317  117280

In [28]:
grouped.filter(lambda x:x["Salary"].mean()> 60000)

    Department Employee  Salary
0           HR    Aarav   74126
1    Marketing   Vivaan  100580
2      Finance   Aditya   84363
3           HR   Vihaan   77793
4      Finance    Arjun   50397
5           IT      Sai   99134
6           HR  Krishna   67772
7   Operations   Ishaan  115962
8    Marketing    Rohan  101648
9           IT    Aryan   99067
10  Operations   Ananya   57501
11          IT     Diya   69235
12   Marketing     Isha   93591
13          HR   Saanvi   73368
14   Marketing    Kavya   73435
15          IT    Aditi   71246
16  Operations    Nisha  117280
17  Operations    Priya   97869
18          HR    Sneha   83633
19          IT    Meera   82008
20          HR     Riya   65266
21          HR     Neha  105811
22     Finance    Pooja   88074
23     Finance   Anjali   88036
24     Finance   Simran   52537
25     Finance    Tanya   53615
26  Operations   Manish   50317
27  Operations    Rahul   84392
28  Operations     Amit   55907
29          HR   Suresh   59688